DataProcessors/Инфотек_СинхронизацияСправочныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Инфотек_СинхронизацияСправочныхДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инфотек_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказНаряды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УспешноОтправлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Инфотек_СоответствиеОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Инфотек_СоответствиеОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.Инфотек_ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Инфотек_ВидыОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаУточнения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.Инфотек_ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектУточнения</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Инфотек_ВидыОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инфотек_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Инфотек_СинхронизацияСправочныхДанных/Forms/Форма/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// Модуль основной формы обработки "Инфотек_СинхронизацияСправочныхДанных"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ПериодДокументовЗаказНаряды.Вариант = ВариантСтандартногоПериода.Сегодня;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормыСопоставленияДанных

&НаСервере
Процедура НастройкаПодключенияПриИзмененииНаСервере() 
	
	СвойствоЗаказНаряда = НастройкаПодключения.СвойствоЗаказНарядаТО;  
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияПриИзменении(Элемент)
	
	НастройкаПодключенияПриИзмененииНаСервере();  
	СвойствоЗаказНарядаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СвойствоЗаказНарядаПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(СвойствоЗаказНаряда) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойств.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗначенияСвойств КАК ЗначенияСвойств
		|ГДЕ
		|	ЗначенияСвойств.Владелец = &Владелец";	 
		Запрос.УстановитьПараметр("Владелец", СвойствоЗаказНаряда);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗначенияСвойствЗаказНаряда.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойствоЗаказНарядаПриИзменении(Элемент)  
	
	СвойствоЗаказНарядаПриИзмененииНаСервере();   
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицФормыСопоставленияДанных

&НаКлиенте
Процедура Объекты1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка,ТипРедактирования,ТекДанные) 
	
	СтандартнаяОбработка = Ложь;
	
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из ТекДанные.Объекты1С Цикл
		СписокВыбора.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокРедактирования",СписокВыбора);
	ПараметрыФормы.Вставить("ТипРедактирования",ТипРедактирования);
	
	РезультатОткрытия = Неопределено;
	ОткрытьФорму("Обработка.Инфотек_СинхронизацияСправочныхДанных.Форма.ФормаПодбораВСписокЗначений",ПараметрыФормы,,,,, Новый ОписаниеОповещения("Объекты1СНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("ТекДанные", ТекДанные)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура Объекты1СНачалоВыбораТО(Элемент, ДанныеВыбора, СтандартнаяОбработка,ТипРедактирования,ТекДанные) 
	
	СтандартнаяОбработка = Ложь;
	
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из ТекДанные.Объекты1С Цикл
		СписокВыбора.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокРедактирования",СписокВыбора);
	ПараметрыФормы.Вставить("ТипРедактирования",ТипРедактирования);
    ПараметрыФормы.Вставить("ЗначенияСвойствЗаказНаряда",ЗначенияСвойствЗаказНаряда);

	РезультатОткрытия = Неопределено;
	ОткрытьФорму("Обработка.Инфотек_СинхронизацияСправочныхДанных.Форма.ФормаПодбораВСписокЗначений",ПараметрыФормы,,,,, Новый ОписаниеОповещения("Объекты1СНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("ТекДанные", ТекДанные)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура Объекты1СНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	
	РезультатОткрытия = Результат;
	
	Если РезультатОткрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.Объекты1С.Очистить();
	
	Для Каждого ЭлементСписка Из РезультатОткрытия Цикл
		Если Не ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		ТекДанные.Объекты1С.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура БрендыОбъекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка)     
	
	Объекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка,"Бренд",Элементы.Бренды.ТекущиеДанные);  
	
КонецПроцедуры

&НаКлиенте
Процедура МоделиОбъекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка)  
	
	Объекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка,"Модель",Элементы.Модели.ТекущиеДанные);  
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОбъекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка)  
	
	Объекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка,"Сотрудник",Элементы.Сотрудники.ТекущиеДанные); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаТООбъекты1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(СвойствоЗаказНаряда) Тогда
		Сообщить("Укажите свойство заказ наряда для определения значений сопоставления"); 
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	Объекты1СНачалоВыбораТО(Элемент,ДанныеВыбора,СтандартнаяОбработка,"ВидРемонтаТО",Элементы.ВидыРемонтаТО.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтосалоныОбъекты1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Объекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка,"Автосалон",Элементы.Автосалоны.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродавцыОбъекты1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Объекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка,"Продавец",Элементы.Продавцы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура МестаХраненияАвтомобилейОбъекты1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)   
	
	Объекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка,"МестоХранения",Элементы.МестаХраненияАвтомобилей.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникиОбращенияОбъекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка) 
	
	Объекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка,"ИсточникОбращения",Элементы.ИсточникиОбращения.ТекущиеДанные); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПричиныОтказаОбъекты1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Объекты1СНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка,"ПричинаОтказа",Элементы.ПричиныОтказа.ТекущиеДанные);     
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьБренды(Команда) 
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для чтения параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;
	
	ПрочитатьБрендыНаСервере();  
	
КонецПроцедуры 

&НаСервере
Процедура ПрочитатьБрендыНаСервере()
	
	ЗаполнитьТаблицуФормыПоДаннымСайта(Инфотек_ИнтеграцияCRM.ПолучитьМассивБрендов(НастройкаПодключения,БрендыTradeIn),ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Бренд,Бренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьМодели(Команда)  
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для чтения параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;
	
	ПрочитатьМоделиНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьМоделиНаСервере()     
	
	Если Не ЗначениеЗаполнено(Бренд) Тогда
		Сообщить("Для чтения данных укажите отбор по бренду!");
		Возврат;
	КонецЕсли;
	id_бренда = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Бренд,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Бренд);
	Если Не ЗначениеЗаполнено(id_бренда) Тогда
		Сообщить("Данный бренд не сопоставлен с CRM!");
		Возврат;
	КонецЕсли;	
	ЗаполнитьТаблицуФормыПоДаннымСайта(Инфотек_ИнтеграцияCRM.ПолучитьМассивМоделей(НастройкаПодключения,id_бренда,МоделиTradeIn),ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Модель,Модели);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьКомплектации(Команда) 
	
	ПрочитатьКомплектацииНаСервере();  
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКомплектацииНаСервере() 
	
	Если Не ЗначениеЗаполнено(Модель) Тогда
		Сообщить("Для чтения данных укажите отбор по модели!");
		Возврат;
	КонецЕсли;
	id_модели = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,Модель,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Модель);
	Если Не ЗначениеЗаполнено(id_модели) Тогда
		Сообщить("Данная модель не сопоставлена с CRM!");
		Возврат;
	КонецЕсли;	
	ЗаполнитьТаблицуФормыПоДаннымСайта(Инфотек_ИнтеграцияCRM.ПолучитьМассивКомплектаций(НастройкаПодключения,id_модели),ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Комплектация,Комплектации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСотрудников(Команда)    
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для чтения параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;
	
	ПрочитатьСотрудниковНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСотрудниковНаСервере() 
	
	ЗаполнитьТаблицуФормыПоДаннымСайта(Инфотек_ИнтеграцияCRM.ПолучитьМассивСотрудников(НастройкаПодключения),ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник,Сотрудники);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьВидыРемонтаТОНаСервере()
	
	ЗаполнитьТаблицуФормыПоДаннымСайта(Инфотек_ИнтеграцияCRM.ПолучитьМассивВидовРемонтаТО(НастройкаПодключения),ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ВидРемонтаТО,ВидыРемонтаТО);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьВидыРемонтаТО(Команда)
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Укажите настройку подключения");
		Возврат;
	КонецЕсли;

	ПрочитатьВидыРемонтаТОНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПрочитатьПродавцыНаСервере()
	
	ЗаполнитьТаблицуФормыПоДаннымСайта(Инфотек_ИнтеграцияCRM.ПолучитьМассивПродавцов(НастройкаПодключения),ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Продавец,Продавцы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьПродавцы(Команда)
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Укажите настройку подключения");
		Возврат;
	КонецЕсли;
	
	ПрочитатьПродавцыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьАвтосалоныНаСервере()
	
	ЗаполнитьТаблицуФормыПоДаннымСайта(Инфотек_ИнтеграцияCRM.ПолучитьМассивАвтосалонов(НастройкаПодключения),ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Автосалон,Автосалоны);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьАвтосалоны(Команда)
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Укажите настройку подключения");
		Возврат;
	КонецЕсли;

	ПрочитатьАвтосалоныНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьИсточникиОбращения(Команда)  
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для чтения параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;
	
	ПрочитатьИсточникиОбращенияНаСервере();    
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьИсточникиОбращенияНаСервере()
	
	ЗаполнитьТаблицуФормыПоДаннымСайта(Инфотек_ИнтеграцияCRM.ПолучитьМассивИсточниковОбращений(НастройкаПодключения),ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ИсточникОбращения,ИсточникиОбращения);
		
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьПричиныОтказа(Команда)    
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для чтения параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;
	
	ПрочитатьПричиныОтказаСервере();   
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПричиныОтказаСервере() 
	
	ЗаполнитьТаблицуФормыПоДаннымСайта(Инфотек_ИнтеграцияCRM.ПолучитьМассивПричинОтказа(НастройкаПодключения),ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ПричинаОтказа,ПричиныОтказа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьМестаХранения(Команда) 
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Укажите настройку подключения");
		Возврат;
	КонецЕсли;

	ПрочитатьМестаХраненияНаСервере();   
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьМестаХраненияНаСервере()       
	
	ЗаполнитьТаблицуФормыПоДаннымСайта(Инфотек_ИнтеграцияCRM.ПолучитьМассивМестХранения(НастройкаПодключения),ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.МестоХранения,МестаХраненияАвтомобилей);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияБрендов(Команда)     
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для записи параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;	
	ЗаписатьИзмененияБрендовНаСервере();  
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияБрендовНаСервере()  
	
	ЗаписатьИзмененияСоответствий(ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Бренд,Бренды);   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияМоделей(Команда) 
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для записи параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;
	ЗаписатьИзмененияМоделейНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияМоделейНаСервере()   
	
	ЗаписатьИзмененияСоответствийСОтборами(ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Модель,Модели);   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияКомплектаций(Команда)
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для записи параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;
	ЗаписатьИзмененияКомплектацийНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияКомплектацийНаСервере()   
	
	ЗаписатьИзмененияСоответствийСОтборами(ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Комплектация,Комплектации);  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияСотрудников(Команда)    
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для записи параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;
	ЗаписатьИзмененияСотрудниковНаСервере();   
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияСотрудниковНаСервере()     
	
	ЗаписатьИзмененияСоответствий(ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Сотрудник,Сотрудники);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияВидовРемонтаТОНаСервере()
	
	ЗаписатьИзмененияСоответствий(ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ВидРемонтаТО,ВидыРемонтаТО);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияВидовРемонтаТО(Команда)
	
	ЗаписатьИзмененияВидовРемонтаТОНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияАвтосалоновНаСервере()
	
	ЗаписатьИзмененияСоответствий(ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Автосалон,Автосалоны);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияАвтосалонов(Команда)
	
	ЗаписатьИзмененияАвтосалоновНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияПродавцовНаСервере()
	
	ЗаписатьИзмененияСоответствий(ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Продавец,Продавцы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияПродавцов(Команда)
	
	ЗаписатьИзмененияПродавцовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияИсточниковОбращения(Команда)   
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для записи параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;	
	ЗаписатьИсточникиОбращенияНаСервере();    
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИсточникиОбращенияНаСервере()  
	
	ЗаписатьИзмененияСоответствий(ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ИсточникОбращения,ИсточникиОбращения);       
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияПричинОтказаСервере()       
	
	ЗаписатьИзмененияСоответствий(ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ПричинаОтказа,ПричиныОтказа);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияПричинОтказа(Команда)
	
	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для записи параметров соответствия укажите настройку подключения");
		Возврат;
	КонецЕсли;	
	ЗаписатьИзмененияПричинОтказаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияМестХраненияНаСервере()  
	
	ЗаписатьИзмененияСоответствий(ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.МестоХранения,МестаХраненияАвтомобилей);  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияМестХранения(Команда)
	
	ЗаписатьИзмененияМестХраненияНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНарядыУстановитьФлажки(Команда) 
	
	Для Каждого Стр Из Объект.ЗаказНаряды Цикл
		Стр.Пометка = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНарядыСнятьФлажки(Команда)
	
	Для Каждого Стр Из Объект.ЗаказНаряды Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаказНаряды(Команда)
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для заполнения списка документов укажите настройку подключения");
		Возврат;
	КонецЕсли;	
	ЗаполнитьЗаказНарядыНаСервере();  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказНарядыНаСервере()
	
	Объект.ЗаказНаряды.Очистить();
	
	Запрос = Новый запрос();
	Запрос.УстановитьПараметр("ДН",ПериодДокументовЗаказНаряды.ДатаНачала);
	Запрос.УстановитьПараметр("ДК",КонецДня(ПериодДокументовЗаказНаряды.ДатаОкончания));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Дата МЕЖДУ &ДН И &ДК";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ВыгружатьПодразделение = Ложь;
		ВыгружатьОрганзацию = Ложь;
				
		Если НастройкаПодключения.Подразделения.Количество() = 0 Тогда
			ВыгружатьПодразделение = Истина;
		Иначе
			Для Каждого СтрокаПодразделения из НастройкаПодключения.Подразделения Цикл
				Если СтрокаПодразделения.Подразделение =  Выборка.Ссылка.ПодразделениеКомпании Тогда
					ВыгружатьПодразделение = Истина;
				КонецЕсли
			КонецЦикла;
		КонецЕсли;
		
		Если НастройкаПодключения.Организации.Количество() = 0 Тогда
			ВыгружатьОрганзацию = Истина;
		Иначе
			Для Каждого СтрокаОрганизации из НастройкаПодключения.Организации Цикл
				Если СтрокаОрганизации.Организация =  Выборка.Ссылка.Организация Тогда
					ВыгружатьОрганзацию = Истина;
				КонецЕсли
			КонецЦикла;
		КонецЕсли;
		
		Если  ВыгружатьОрганзацию И  ВыгружатьПодразделение Тогда
			НоваяСтрока = Объект.ЗаказНаряды.Добавить();
			НоваяСтрока.Документ = Выборка.ссылка;
			НоваяСтрока.Пометка = Истина;
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьЗаказНаряды(Команда)   
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Сообщить("Для передачи документов в CRM систему укажите настройку подключения");
		Возврат;
	КонецЕсли;		
	ПередатьЗаказНарядыНаСервере();  
	
КонецПроцедуры

&НаСервере
Процедура ПередатьЗаказНарядыНаСервере()   
	
	Для Каждого СтрокаТЗ из Объект.ЗаказНаряды цикл
		Если Не СтрокаТЗ.Пометка Тогда
			Продолжить;
		КонецЕсли;	
		ОписаниеЗаказНаряда = Инфотек_ИнтеграцияCRMПереопределяемый.ПолучитьОписаниеЗаказНарядаCRM(СтрокаТЗ.Документ,НастройкаПодключения);
		Если ОписаниеЗаказНаряда <> Неопределено Тогда 
			СтрокаТЗ.УспешноОтправлен = Инфотек_ИнтеграцияCRM.СоздатьОбновитьЗаказНарядВCRM(СтрокаТЗ.Документ,ОписаниеЗаказНаряда,НастройкаПодключения);			
			Если Не СтрокаТЗ.УспешноОтправлен Тогда
				Сообщить("Произошла ошибка! Не удалось передать документ в CRM-систему!!!");
			КонецЕсли;
			Если СтрокаТЗ.УспешноОтправлен Тогда
				ИдентификаторВидаРемонтаТО = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,СтрокаТЗ.Документ.ВидРемонта,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ВидРемонтаТО);
				Если Не ЗначениеЗаполнено(ИдентификаторВидаРемонтаТО) Тогда
					Для Каждого СтрокаРабот ИЗ СтрокаТЗ.Документ.Работы Цикл
						ИдентификаторВидаРемонтаТО = Инфотек_ОбщиеПроцедуры.ПолучитьИдентификаторСоответствияПоОбъекту(НастройкаПодключения,СтрокаРабот.Работа,ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ВидРемонтаТО);
						Если ЗначениеЗаполнено(ИдентификаторВидаРемонтаТО) Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если ЗначениеЗаполнено(ИдентификаторВидаРемонтаТО) Тогда
					СтрокаТЗ.УспешноОтправлен = Инфотек_ИнтеграцияCRM.ОбработатьДанныеПоТО(СтрокаТЗ.Документ,ИдентификаторВидаРемонтаТО,НастройкаПодключения);	
					Если Не СтрокаТЗ.УспешноОтправлен Тогда
						Сообщить("Произошла ошибка! Не удалось передать данные по ТО в CRM-систему!!!");
					КонецЕсли;
				КонецЕсли;					
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуФормыПоДаннымСайта(МассивДанных,ВидОбъекта,ТаблицаЗаполнения)  
	
	Если МассивДанных.Количество() = 0 Тогда
		Сообщить("Настройки подключения (логин и пароль) к CRM введены не корректно или нет связи с сервером!");
		Возврат;
	КонецЕсли;     
	
	ТаблицаЗаполнения.Очистить();	
	ТаблицаСоответствий = Инфотек_ОбщиеПроцедуры.ПолучитьТаблицуСоответствийПоВидуОбъекта(НастройкаПодключения,ВидОбъекта);
	
	Для каждого ТекДанные ИЗ МассивДанных Цикл
		НоваяСтрока               = ТаблицаЗаполнения.Добавить();
		НоваяСтрока.Идентификатор = ТекДанные.id;  
		Попытка
			НоваяСтрока.Наименование = Строка(ТекДанные.last_name) + " " + Строка(ТекДанные.first_name) + " " + Строка(ТекДанные.middle_name);
		Исключение
			НоваяСтрока.Наименование  = ТекДанные.name;
		КонецПопытки;
		Попытка  
			НоваяСтрока.ИдентификаторСалона = ТекДанные.salon_id;	
			Салон = Инфотек_ИнтеграцияCRM.ПолучитьСалонПоИдентификатору(НастройкаПодключения,ТекДанные.salon_id);
			Если Салон <> Неопределено Тогда
				НоваяСтрока.НаименованиеСалона = Салон.name;
			КонецЕсли;
		Исключение
		КонецПопытки;
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Идентификатор",НоваяСтрока.Идентификатор);
		
		НайденныеСтроки = ТаблицаСоответствий.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого Стр Из НайденныеСтроки Цикл
			НоваяСтрока.Объекты1С.Добавить(Стр.Объект);		
		КонецЦикла;
		Если ВидОбъекта = ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ПричинаОтказа Тогда  
			Если ТекДанные.id = НастройкаПодключения.ИдентфикаторПричиныОтказаОтКонтрактаПоУмолчанию Тогда
				НоваяСтрока.ВыбиратьПоУмолчанию = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуФормыПоДаннымСайтаИзСоответствия(МассивДанных,ВидОбъекта,ТаблицаЗаполнения)

	ТаблицаЗаполнения.Очистить();	
	ТаблицаСоответствий = Инфотек_ОбщиеПроцедуры.ПолучитьТаблицуСоответствийПоВидуОбъекта(НастройкаПодключения,ВидОбъекта);
	
	Для каждого ТекДанные ИЗ МассивДанных Цикл
		НоваяСтрока               = ТаблицаЗаполнения.Добавить();
		НоваяСтрока.Идентификатор = ТекДанные.Ключ;
		НоваяСтрока.Наименование  = ТекДанные.Значение;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Идентификатор",НоваяСтрока.Идентификатор);
		
		НайденныеСтроки = ТаблицаСоответствий.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого Стр Из НайденныеСтроки Цикл
			НоваяСтрока.Объекты1С.Добавить(Стр.Объект);		
		КонецЦикла;		
	КонецЦикла;    
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияСоответствий(ВидОбъекта,НоваяТаблицаСоответствий)
	
	НачатьТранзакцию();
	
	Если ВидОбъекта = ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.ПричинаОтказа Тогда  
		ПричинаОтказаОтКонтрактаПоУмолчаниюВыбрана = Ложь;	
		Для Каждого Запись Из НоваяТаблицаСоответствий Цикл  
			Если Запись.ВыбиратьПоУмолчанию = Истина Тогда
				ПричинаОтказаОтКонтрактаПоУмолчаниюВыбрана = Истина;  
				ОбъектНастройкиПодключения = НастройкаПодключения.ПолучитьОбъект();
				ОбъектНастройкиПодключения.ОбменДанными.Загрузка = Истина;
				ОбъектНастройкиПодключения.ИдентфикаторПричиныОтказаОтКонтрактаПоУмолчанию = Запись.Идентификатор;
				ОбъектНастройкиПодключения.Записать();
			КонецЕсли;
		КонецЦикла;
		Если ПричинаОтказаОтКонтрактаПоУмолчаниюВыбрана = Ложь Тогда
			Сообщить("Для записи параметров соответствия укажите причину отказа по умолчанию!");  
			Возврат;
		КонецЕсли;  
	КонецЕсли;  
	
	Инфотек_ОбщиеПроцедуры.ОчиститьСоответствияПоВидуОбъекта(ВидОбъекта,НастройкаПодключения);
	
	Для Каждого Запись Из НоваяТаблицаСоответствий Цикл
		Для Каждого ЭлементСписка Из Запись.Объекты1С Цикл
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,ЭлементСписка.Значение,ВидОбъекта,Запись.Идентификатор);
		КонецЦикла;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияСоответствийСОтборами(ВидОбъекта,НоваяТаблицаСоответствий)
	
	НачатьТранзакцию();
		
	Для Каждого Запись Из НоваяТаблицаСоответствий Цикл
		Для Каждого ЭлементСписка Из Запись.Объекты1С Цикл
			Инфотек_ОбщиеПроцедуры.ЗаписатьСоответствиеОбъектов(НастройкаПодключения,ЭлементСписка.Значение,ВидОбъекта,Запись.Идентификатор);
		КонецЦикла;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМаркиНаСервере()
	
	СписокВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Инфотек_СоответствиеОбъектов.Объект
	|ИЗ
	|	РегистрСведений.Инфотек_СоответствиеОбъектов КАК Инфотек_СоответствиеОбъектов
	|ГДЕ
	|	Инфотек_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
	|	И Инфотек_СоответствиеОбъектов.НастройкаПодключения = &НастройкаПодключения";
	Запрос.УстановитьПараметр("ВидОбъекта", ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Бренд);
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокВыбора.Добавить(Выборка.Объект);
			СправочникСсылка = Выборка.Объект;
			Пока Не СправочникСсылка.Родитель.Пустая() Цикл
				СправочникСсылка = СправочникСсылка.Родитель;	
				СписокВыбора.Добавить(СправочникСсылка);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	Возврат СписокВыбора;

КонецФункции

#КонецОбласти
